app/controllers/admin/travel_packages_controller.rb

  def index
    @private_service = PrivateService.find(params[:private_service_id])
    #@travel_packages = @private_service.travel_packages.paginate(:all, :page => params[:page] || 1, :per_page => 5, :order => "name")
    @travel_packages = @private_service.travel_packages.page(params[:page]).per(10)
---
SELECT "travel_packages".* FROM "travel_packages"